In [64]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [65]:
height=Series([187,190,185,178,185],index=["13","14","7","2","9"])
height

13    187
14    190
7     185
2     178
9     185
dtype: int64

In [66]:
height["13"]

187

In [67]:
height[["13","7"]]

13    187
7     185
dtype: int64

In [68]:
height[1:3]

14    190
7     185
dtype: int64

In [69]:
height[[0,1]]

13    187
14    190
dtype: int64

In [70]:
height[height.values>186]

13    187
14    190
dtype: int64

In [71]:
height["13"]=188
height

13    188
14    190
7     185
2     178
9     185
dtype: int64

In [72]:
height[[1,2]]=160
height

13    188
14    160
7     160
2     178
9     185
dtype: int64

In [73]:
a=Series([190,187],index=["23","5"])
newheight1=height.append(a)
newheight1

13    188
14    160
7     160
2     178
9     185
23    190
5     187
dtype: int64

In [74]:
newheight2=height.drop(["13","2"])
newheight2

14    160
7     160
9     185
dtype: int64

In [75]:
height.index=[1,2,3,4,5]
height

1    188
2    160
3    160
4    178
5    185
dtype: int64

In [76]:
height[[2,3]]

2    160
3    160
dtype: int64

In [77]:
height.iloc[[2,3]]

3    160
4    178
dtype: int64

In [78]:
students=DataFrame([[19,170,68],[20,165,65],[18,175,65]],index=[1,2,3],columns=["age","height","weight"])
students

   age  height  weight
1   19     170      68
2   20     165      65
3   18     175      65

In [79]:
students.loc[1,"age"]

19

In [80]:
students.loc[[1,3],["height","weight"]]

   height  weight
1     170      68
3     175      65

In [81]:
students.iloc[[0,2],[0,1]]

   age  height
1   19     170
3   18     175

In [82]:
students.loc[:,["height","weight"]]

   height  weight
1     170      68
2     165      65
3     175      65

In [83]:
students.iloc[1:,0:2]

   age  height
2   20     165
3   18     175

In [84]:
students.iloc[1:3]

   age  height  weight
2   20     165      65
3   18     175      65

In [85]:
students[1:3]      #跟上头一样

   age  height  weight
2   20     165      65
3   18     175      65

In [86]:
mask=students["height"]>=168   #要先用mask创建bool数组
mask

1     True
2    False
3     True
Name: height, dtype: bool

In [87]:
students.loc[mask,["height","weight"]]

   height  weight
1     170      68
3     175      65

In [88]:
students["expense"]=[1500,1600,1200]
students

   age  height  weight  expense
1   19     170      68     1500
2   20     165      65     1600
3   18     175      65     1200

In [89]:
students["expense"]=1000
students

   age  height  weight  expense
1   19     170      68     1000
2   20     165      65     1000
3   18     175      65     1000

In [90]:
students.loc[1]=[21,188,70,20]
students

   age  height  weight  expense
1   21     188      70       20
2   20     165      65     1000
3   18     175      65     1000

In [91]:
students.loc[students["expense"]<500,"expense"]=1200
students

   age  height  weight  expense
1   21     188      70     1200
2   20     165      65     1000
3   18     175      65     1000

In [92]:
students.drop(1,axis=0)

   age  height  weight  expense
2   20     165      65     1000
3   18     175      65     1000

In [93]:
students.drop(1,axis=0)
students    #原始数据不变

   age  height  weight  expense
1   21     188      70     1200
2   20     165      65     1000
3   18     175      65     1000

In [94]:
students.drop("expense",axis=1)

   age  height  weight
1   21     188      70
2   20     165      65
3   18     175      65

In [54]:
students.drop([1,2],axis=0)

   age  height  weight  expense
3   18     175      65     1000

In [96]:
students.drop(["age","weight"],axis=1, inplace=True)
students

   height  expense
1     188     1200
2     165     1000
3     175     1000